kOmegaSST_Model/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 5.88e-05;

boundaryField
{
    airfoil
    {
        type            fixedValue;
        value           uniform 0;
    }

    outlet
    {
        type            freestream;
        freestreamValue $internalField;
    }
	
    inlet
    {
        type            freestream;
        freestreamValue $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
